app/views/reservas/index.html.slim

  tbody
    - current_user.reservas.each do |reserva|
---
SELECT "reservas".* FROM "reservas" WHERE "reservas"."user_id" = ?  [["user_id", 1]]