app/helpers/application_helper.rb

    def reserva_ativa
        if current_user != nil
            @reserva = current_user.reservas.last
          else
            @reserva = Reserva.last
---
SELECT  "reservas".* FROM "reservas" WHERE "reservas"."user_id" = ? ORDER BY "reservas"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "reservas".* FROM "reservas" ORDER BY "reservas"."id" DESC LIMIT ?  [["LIMIT", 1]]