app/views/confirmation_reserva_mailer/notify_user.html.slim

  tbody
    - @reserva.miniaturas.each do |miniatura|
---
SELECT "miniaturas".* FROM "miniaturas" INNER JOIN "miniaturas_reservas" ON "miniaturas"."id" = "miniaturas_reservas"."miniatura_id" WHERE "miniaturas_reservas"."reserva_id" = ?  [["reserva_id", 10]]