app/controllers/application_controller.rb

SELECT  "reservas".* FROM "reservas" WHERE "reservas"."user_id" = ? ORDER BY "reservas"."id" DESC LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
    def active_reserva
        if user_signed_in?
            @reserva = current_user.reservas.last