app/controllers/home_controller.rb

  def index
    @miniaturas = Miniatura.all
    if current_user != nil
      @reserva = current_user.reservas.last
    else
      @reserva = Reserva.last
---
SELECT "miniaturas".* FROM "miniaturas"
SELECT  "reservas".* FROM "reservas" WHERE "reservas"."user_id" = ? ORDER BY "reservas"."id" DESC LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT  "reservas".* FROM "reservas" ORDER BY "reservas"."id" DESC LIMIT ?  [["LIMIT", 1]]