app/controllers/miniaturas_controller.rb

SELECT "miniaturas".* FROM "miniaturas"
---
  def index
    @miniaturas = Miniatura.all

SELECT  "reservas".* FROM "reservas" WHERE "reservas"."user_id" = ? ORDER BY "reservas"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def show
    if current_user != nil
      @reserva = current_user.reservas.last

INSERT INTO "miniaturas" ("nome", "tamanho", "preco", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @miniatura = Miniatura.new(miniatura_params)

    respond_to do |format|
      if @miniatura.save

SELECT  "miniaturas".* FROM "miniaturas" WHERE "miniaturas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_miniatura
      @miniatura = Miniatura.find(params[:id])