app/controllers/miniaturas_reservas_controller.rb

SELECT "miniaturas_reservas".* FROM "miniaturas_reservas"
SELECT  "reservas".* FROM "reservas" ORDER BY "reservas"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @miniaturas_reservas = MiniaturasReserva.all

SELECT  "miniaturas".* FROM "miniaturas" WHERE "miniaturas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    if params[:active] == 'true'
      redirect_to new_reserva_path, notice: 'Crie uma nova Reserva'
    else
      @miniatura = params[:miniatura]
      @miniatura_nome = Miniatura.find(params[:miniatura]).nome

INSERT INTO "miniaturas_reservas" ("reserva_id", "miniatura_id", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["reserva_id", 23], ["miniatura_id", 1], ["quantidade", 3], ["created_at", "2018-10-04 15:51:25.785011"], ["updated_at", "2018-10-04 15:51:25.785011"]]
SELECT  "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
SELECT  "miniaturas".* FROM "miniaturas" WHERE "miniaturas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reservas" SET "preco_total" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["preco_total", 63.0], ["updated_at", "2018-10-04 15:51:25.925369"], ["id", 23]]
---
  def create
    @miniaturas_reserva = MiniaturasReserva.new(miniaturas_reserva_params)

    respond_to do |format|
      if @miniaturas_reserva.save
        format.html { redirect_to home_index_url, notice: 'Miniaturas reserva was successfully created.' }
        format.json { render :show, status: :created, location: @miniaturas_reserva }
      else
        format.html { render :new }
        format.json { render json: @miniaturas_reserva.errors, status: :unprocessable_entity }
      end
      @reserva = Reserva.where(id: @miniaturas_reserva.reserva_id).take
      @miniatura = Miniatura.where(id: @miniaturas_reserva.miniatura_id).take
      if(@reserva != nil)
        if(@reserva.preco_total == nil)
          @preco_total = (@miniatura.preco * @miniaturas_reserva.quantidade)
        else
          @preco_total = @reserva.preco_total + (@miniatura.preco * @miniaturas_reserva.quantidade)
        end
        @reserva.update(preco_total: @preco_total)

SELECT  "miniaturas_reservas".* FROM "miniaturas_reservas" WHERE "miniaturas_reservas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_miniaturas_reserva
      @miniaturas_reserva = MiniaturasReserva.find(params[:miniatura_id, :reserva_id])