app/controllers/reserva_miniaturas_controller.rb

SELECT "reserva_miniaturas".* FROM "reserva_miniaturas"
---
  def index
    @reserva_miniaturas = ReservaMiniatura.all

INSERT INTO "reserva_miniaturas" ("quantidade", "created_at", "updated_at", "reserva_id", "miniatura_id") VALUES (?, ?, ?, ?, ?)  [["quantidade", 2], ["created_at", "2018-09-29 15:41:07.092918"], ["updated_at", "2018-09-29 15:41:07.092918"], ["reserva_id", 2], ["miniatura_id", 1]]
---
  def create
    @reserva_miniatura = ReservaMiniatura.new(reserva_miniatura_params)

    respond_to do |format|
      if @reserva_miniatura.save

SELECT  "miniaturas".* FROM "miniaturas" WHERE "miniaturas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reserva_miniaturas".* FROM "reserva_miniaturas" WHERE "reserva_miniaturas"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_reserva_miniatura
      @reserva_miniatura = ReservaMiniatura.find(params[:id])