app/controllers/reservas_controller.rb

SELECT  "reservas".* FROM "reservas" ORDER BY "reservas"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @reservas = Reserva.all

SELECT  "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "reservas" SET "confirmation" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["confirmation", 1], ["updated_at", "2018-10-02 20:35:16.712592"], ["id", 19]]
---
  def confirmar_reserva
    @reserva = Reserva.find(params[:id])
    if @reserva.preco_total != nil
      ConfirmationReservaMailer.notify_user(@reserva, current_user).deliver
      ReportReservaMailer.notify_admin(@reserva, current_user).deliver
      @reserva.update(:confirmation => true)

INSERT INTO "reservas" ("data_da_reserva", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["data_da_reserva", "2018-10-02"], ["created_at", "2018-10-02 20:34:03.005164"], ["updated_at", "2018-10-02 20:34:03.005164"], ["user_id", 1]]
---
  def create
    @reserva = current_user.reservas.build(reserva_params)

    respond_to do |format|
      if @reserva.save

UPDATE "reservas" SET "preco_total" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["preco_total", 4.0], ["updated_at", "2018-09-27 22:24:57.083290"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @reserva.update(reserva_params)

DELETE FROM "reservas" WHERE "reservas"."id" = ?  [["id", 22]]
---
  def destroy
    @reserva.destroy

SELECT  "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
    def set_reserva
      @reserva = Reserva.find(params[:id])