app/models/miniatura.rb

SELECT  "miniaturas_reservas".* FROM "miniaturas_reservas" WHERE "miniaturas_reservas"."miniatura_id" = ? AND "miniaturas_reservas"."reserva_id" = ? LIMIT ?  [["miniatura_id", 1], ["reserva_id", 3], ["LIMIT", 1]]
---
    def getQuantidade(reserva)
        @miniaturaReserva = MiniaturasReserva.where(:miniatura_id => self.id, :reserva_id => reserva.id).take